In [72]:
import pandas as pd

In [73]:
df = pd.read_json('store_sales_may2025.json')
df['date']=pd.to_datetime(df['date'])

In [74]:
df['total_sales'] = df['units_sold']*df['price_per_unit']

In [75]:
groups = df.groupby(['store','category']).agg(total_units_sold=('units_sold','sum'),
                                              total_sales=('total_sales','sum'),
                                              avg_price=('price_per_unit','mean')).reset_index()
groups

  store   category  total_units_sold  total_sales  avg_price
0     A      fruit                85        34.50     0.3675
1     B      fruit                45        14.85     0.3850
2     C      fruit                18         9.54     0.5300
3     C  vegetable                60        18.40     0.3100

In [76]:
top_product = df.groupby(['store'])[['total_sales','product']].max().reset_index()
top_product

  store  total_sales product
0     A        15.00  banana
1     B         8.25  banana
2     C        12.00  carrot

In [77]:
daily_sales = df.groupby('date')['total_sales'].sum().reset_index()
best_day = daily_sales.loc[daily_sales['total_sales'].idxmax()].reset_index()
best_day

         index                    0
0         date  2025-05-01 00:00:00
1  total_sales                39.25